# Vyprávíme příběh s daty

## Seznámení s daty

## Pandas 🐼

### Nasťa a Filip Sedlákovi

## Seznámení s daty - postup

1. Načíst data
    - Případně přejmenovat sloupce

2. V jakém formátu jsou sloupce?

3. Kolik je řádků a sloupců?

4. Obsahují některé sloupce chybějící data?

5. Udělat popisnou statistiku dat

## Co je pandas?

- Knihovna pro analýzu dat v Pythonu
- Je postavena na NumPy (knihovna pro práci s numerickými daty)
- [10 minutes to pandas](https://pandas.pydata.org/pandas-docs/stable/10min.html)

## Jak naimportuji pandas?

In [1]:
# Importujeme pandas jako zkrátku
# Není to nutné, ale většina tutorialu to tak má
import pandas as pd

## Jak načtu data?

Pandas má několik funkcí, tady je [hezký](https://pandas.pydata.org/pandas-docs/stable/cookbook.html#data-in-out) přehled

Nejpoužívanější je funkce [`read_csv`](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.read_csv.html), která má více než 20 parametrů (nebojte se, jenom jeden parametr je povinný 🙂)

In [2]:
data = pd.read_csv('http://vincentarelbundock.github.io/Rdatasets/csv/DAAG/primates.csv')
data.head()

      Unnamed: 0  Bodywt  Brainwt
0   Potar monkey    10.0      115
1        Gorilla   207.0      406
2          Human    62.0     1320
3  Rhesus monkey     6.8      179
4          Chimp    52.2      440

In [3]:
data = pd.read_csv('primates.csv')
data.head()

      Unnamed: 0  Bodywt  Brainwt
0   Potar monkey    10.0      115
1        Gorilla   207.0      406
2          Human    62.0     1320
3  Rhesus monkey     6.8      179
4          Chimp    52.2      440

In [4]:
# Zobrazíme index tabulky
data.index

RangeIndex(start=0, stop=5, step=1)

## Cvičení
 
Načtěte data `tips.csv` (jsou ve stejné složce) a použijte první sloupec jako index

**Bonus**: Načtete [data z UNICEF](https://data.unicef.org/wp-content/uploads/2015/12/Out-of-School-Rate-Final-for-website.xlsx) pomocí `read_excel` funkce z pandas a přeskočte prvních 9 řádků

## Jak přejmenuji sloupce?

In [5]:
# Zobrazíme názvy sloupců
data.columns

Index(['Unnamed: 0', 'Bodywt', 'Brainwt'], dtype='object')

In [6]:
# inplace=True znamená, že se pozmění současná tabulka
data.rename(index=str, columns={'Unnamed: 0': 'Species'}, inplace=True)
data

         Species  Bodywt  Brainwt
0   Potar monkey    10.0      115
1        Gorilla   207.0      406
2          Human    62.0     1320
3  Rhesus monkey     6.8      179
4          Chimp    52.2      440

## Cvičení
 
1. Načtěte data `titanic3.xls` pomocí `read_excel` funkce z pandas
2. Přejmenujte sloupec `pclass` na `passenger_class` a `home.dest` na `home_destination`

## Jak zjistím, v jakém formátu jsou sloupce?

In [3]:
data.dtypes

Unnamed: 0     object
Bodywt        float64
Brainwt         int64
dtype: object

## Jak zjistím, kolik má tabulká řádů a sloupců?

In [7]:
# Počet řádků a počet sloupců
data.shape

(5, 3)

In [8]:
# Počet řádků
data.shape[0]

5

In [9]:
# Počet řádků
len(data)

5

## Cvičení
 
1. Načtěte data `titanic3.xls` pomocí `read_excel` funkce z pandas
2. Zjistěte počet řádků (správná odpověď je 1309)
3. Zjistěte počet sloupců (správná odpověď je 14)

## Jak zjistím, zda v tabulce jsou chybějící data?

In [10]:
# Načteme data z Excelu
data = pd.read_excel('titanic3.xls')
data.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [11]:
# Jaké sloupce má tabulka?
data.columns

Index(['pclass', 'survived', 'name', 'sex', 'age', 'sibsp', 'parch', 'ticket',
       'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'],
      dtype='object')

In [12]:
# Má tabulká chybějící data?
data.isnull().values.any()

True

In [13]:
# Zjistíme, které sloupce mají chybějící data
data.isnull().any()

pclass       False
survived     False
name         False
sex          False
age           True
sibsp        False
parch        False
ticket       False
fare          True
cabin         True
embarked      True
boat          True
body          True
home.dest     True
dtype: bool

## Cvičení
 
1. Načtěte data `titanic`
2. Zjistěte, které sloupce mají chybající data (správná odpověď Sleep, Sleep7, SmokeLife, SmokeDaily, MarijuaEver)

**Bonus**: Zjistěte kolík řádků má chybějící data (správná odpověď je 72)

## Jak vyberu řádky a sloupce?

Pandas má 2 způsoby:
- `iloc` vybírá podle pozic (indexů)
    - stejně jako když vybírám ze seznamu
    - bez koncového indexu
- `loc` vybírá podle jmen
    - včetně koncového indexu

In [14]:
# Načteme data
data = pd.read_csv('primates.csv')
data.rename(index=str, columns={'Unnamed: 0': 'Species'}, inplace=True)
data.head()

         Species  Bodywt  Brainwt
0   Potar monkey    10.0      115
1        Gorilla   207.0      406
2          Human    62.0     1320
3  Rhesus monkey     6.8      179
4          Chimp    52.2      440

In [15]:
# Vybereme 0. a 1. řádky
data.iloc[0:2]

        Species  Bodywt  Brainwt
0  Potar monkey    10.0      115
1       Gorilla   207.0      406

In [16]:
# Vybereme 0. a 1. řádky a 1. a 2. sloupce
data.iloc[0:2, 1:3]

   Bodywt  Brainwt
0    10.0      115
1   207.0      406

In [17]:
# Vybíráme podle jména
# POZOR: číselný index musí být převeden řetězec
data.loc['1':'2', ['Species', 'Bodywt']]

   Species  Bodywt
1  Gorilla   207.0
2    Human    62.0

In [18]:
# Vybereme sloupec
data.Bodywt

0     10.0
1    207.0
2     62.0
3      6.8
4     52.2
Name: Bodywt, dtype: float64

In [19]:
# Vybereme sloupec - druhy způsob
data['Bodywt']

0     10.0
1    207.0
2     62.0
3      6.8
4     52.2
Name: Bodywt, dtype: float64

In [20]:
# Lze specifikovat, který sloupec je index
# Index se v tomto případě skládá z řetězců
data = pd.read_csv(
    'primates.csv', 
    index_col=0
)
data.head()

               Bodywt  Brainwt
Potar monkey     10.0      115
Gorilla         207.0      406
Human            62.0     1320
Rhesus monkey     6.8      179
Chimp            52.2      440

In [21]:
data.loc['Potar monkey']

Bodywt      10.0
Brainwt    115.0
Name: Potar monkey, dtype: float64

## Cvičení
 
1. Načtěte data `titanic`
2. Vyberte prvních 20 řádků
3. Vyberte prvních 20 řádků a sloupec se jménem (`name`)

**Bonus**: Vyberte řádky 10 až 550 a následující sloupce: jméno (`name`), cena jízdenky (`fare`), zda osoba přežila (`survived`)

## Jak vyberu řádky, které splňují určitou podmínku?

`data[podmínka]`

`data[(podmínka1) & (podmínka2)]`

In [22]:
data.columns

Index(['Bodywt', 'Brainwt'], dtype='object')

In [23]:
data.Bodywt > 60

Potar monkey     False
Gorilla           True
Human             True
Rhesus monkey    False
Chimp            False
Name: Bodywt, dtype: bool

In [24]:
# Vyberéme řádky, kde tělěsná hmota je více než 60
data[data.Bodywt > 60]

         Bodywt  Brainwt
Gorilla   207.0      406
Human      62.0     1320

In [25]:
# Vyberéme řádky, kde je tělěsná hmota více než 60 a hmota mozku je méně než 500
data[(data.Bodywt > 60) & (data.Brainwt < 500)]

         Bodywt  Brainwt
Gorilla   207.0      406

 ## Cvičení
 
1. Načtěte data `titanic`
2. Vyberte řádky cestujících ženského pohlaví a spočítejte je (správná odpověď je 466)
3. Vyberte řádky cestujících ženského pohlaví, které jsou starší 1 roku a spočítejte je (správná odpověď je 379)

**Bonus**: Pro vybrané řádky spočítejte průměrnou cenu jízdenky (`fare`) (správná odpověď je cca 51)

## Jak seskupím řádky?

Použijeme metodu `groupby`, která seskupí řádky dle jednoho nebo více sloupců.

Potom použijeme nějakou metodu nad seskupenými řádky (`count`, `mean`, `sum`).

In [26]:
# Načteme data z Excelu
data = pd.read_excel('titanic3.xls')
data.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [27]:
# Groupby vrací iterátor
data.groupby('sex')

In [28]:
# Seskupíme řádky dle pohlaví a spočítáme průměrnou hodnotu všech číselných proměnných
data.groupby('sex').mean()

,pclass,survived,age,sibsp,parch,fare,body
sex,,,,,,,
female,2.154506,0.727468,28.687071,0.652361,0.633047,46.198097,166.62500
male,2.372479,0.190985,30.585233,0.413998,0.247924,26.154601,160.39823

In [29]:
# Totéž můžeme udělat pomocí filtrování
data[data.sex == 'female'].mean()

pclass        2.154506
survived      0.727468
age          28.687071
sibsp         0.652361
parch         0.633047
fare         46.198097
body        166.625000
dtype: float64

In [30]:
data[data.sex == 'male'].mean()

pclass        2.372479
survived      0.190985
age          30.585233
sibsp         0.413998
parch         0.247924
fare         26.154601
body        160.398230
dtype: float64

In [31]:
# Seskupení dle více proměnných - pohlaví a místa nalodění
data.groupby(['sex', 'embarked']).mean()

                   pclass  survived        age     sibsp     parch       fare  \
sex    embarked
female C         1.646018  0.902655  31.224490  0.504425  0.513274  81.128540
       Q         2.900000  0.616667  25.458333  0.200000  0.133333  12.550837
       S         2.206186  0.680412  27.877210  0.807560  0.786942  39.339305
male   C         2.000000  0.305732  33.284357  0.324841  0.267516  48.810619
       Q         2.888889  0.111111  31.557692  0.476190  0.095238  12.273941
       S         2.414125  0.170144  29.942407  0.430177  0.258427  21.841878

                       body
sex    embarked
female C         328.000000
       Q         229.000000
       S          79.500000
male   C         155.083333
       Q         134.750000
       S         163.105882

 ## Cvičení

Seskupte `titanic` dle třídy (`pclass`) a pohlaví (`sex`) zobrazte medián (`median`)

**Bonus**: zobrazte jenom sloupec věk (`age`)

## Jak ukažu popisnou statistiku pro všechny sloupce?

In [5]:
# Bez include='all' jenom numerické sloupce
data.describe(include='all')

           Unnamed: 0      Bodywt      Brainwt
count               5    5.000000     5.000000
unique              5         NaN          NaN
top     Rhesus monkey         NaN          NaN
freq                1         NaN          NaN
mean              NaN   67.600000   492.000000
std               NaN   81.724048   483.679129
min               NaN    6.800000   115.000000
25%               NaN   10.000000   179.000000
50%               NaN   52.200000   406.000000
75%               NaN   62.000000   440.000000
max               NaN  207.000000  1320.000000

## Cvičení

Použijte následující postup a seznamte se s [těmito daty](http://vincentarelbundock.github.io/Rdatasets/csv/robustbase/education.csv), [popis dat](http://vincentarelbundock.github.io/Rdatasets/doc/robustbase/education.html)


1. Načíst data
    - Případně přejmenovat sloupce

2. V jakém formátu jsou sloupce?

3. Kolik je řádků a sloupců?

4. Obsahují některé sloupce chybějící data?

5. Udělat popisnou statistiku dat